import pandas as pd
import pytest


@pytest.fixture
def sample_data():
    """Фикстура для создания примерного DataFrame."""
    data = {
        "Дата платежа": pd.to_datetime(
            [
                "2023-01-15",
                "2023-01-20",
                "2023-02-15",
                "2023-02-20",
                "2023-01-25",
                "2023-01-30",
                "2023-02-05",
                "2023-02-10",
            ]
        ),
        "Категория": [
            "Продукты",
            "Развлечения",
            "Продукты",
            "Туризм",
            "Развлечения",
            "Продукты",
            "Туризм",
            "Развлечения",
        ],
        "Сумма операции с округлением": [200, 150, 300, 400, 100, 250, 450, 350],
    }

    return pd.DataFrame(data)
